# Introduction to Pandas & Dataframe

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame()

In [3]:
print(df)

Empty DataFrame
Columns: []
Index: []

In [4]:
df1 = pd.DataFrame([[1,5,3,6],[5,4,8,5],[5,4,6,7],[4,9,3,7],[7,9,3,2],[6,9,3,1]])

In [5]:
df1

   0  1  2  3
0  1  5  3  6
1  5  4  8  5
2  5  4  6  7
3  4  9  3  7
4  7  9  3  2
5  6  9  3  1

In [6]:
df1.head(3) # First theke count hoy

   0  1  2  3
0  1  5  3  6
1  5  4  8  5
2  5  4  6  7

In [7]:
df1.tail(4)  # last theke count hoy

   0  1  2  3
2  5  4  6  7
3  4  9  3  7
4  7  9  3  2
5  6  9  3  1

# Change row column

In [8]:
df1 = pd.DataFrame([[1,5,3,6],[5,4,8,5],[5,4,6,7],[4,9,3,7],[7,9,3,2],[6,9,3,1]],columns=["a","b","c","d"])

In [9]:
df1

   a  b  c  d
0  1  5  3  6
1  5  4  8  5
2  5  4  6  7
3  4  9  3  7
4  7  9  3  2
5  6  9  3  1

# Slicing, adding columns & other DataFrame Tips

In [10]:
df1

   a  b  c  d
0  1  5  3  6
1  5  4  8  5
2  5  4  6  7
3  4  9  3  7
4  7  9  3  2
5  6  9  3  1

In [11]:
df1.shape

(6, 4)

In [12]:
df1.iloc[2:4,1:3]

   b  c
2  4  6
3  9  3